<?php
/**
 * count(); 
 بدست آوردن تعداد عناصر در یک آرایه     
 * sizeOf();
 بدست آوردن تعداد عناصر در یک آرایه  
 * array_sum(10,20,30);   --->50
 جمع گردن عناصر داخل آرایه
 * func_get_args();
 مقادیری رو که بهش میفرستیم رو به صورت آرایه برمی گردونه
 * json_encode(); 
 تبدیل آرایه به جی سون
 * json_decode(); 
 تبدیل جی سون به آرایه
 * date();
 بدست آوردن تاریخ و زمان
 * strToLower(); 
 تبدیل تمامی حروف به حروف کوچک
 * strToUpper();
 تبدیل تمامی حروف به حروف بزرگ
 * is_callable()
 چک میکنه که متغیری که بهش ارسال میشه از این نوع هست یا نه
 *
 */
